#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
tls_private_key.paks: Refreshing state... [id=7ea918c8625b11855469cff5187799d4c893fca4]
azurerm_resource_group.aks: Refreshing state... [id=/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks]
azurerm_virtual_network.aksvnet: Refreshing state... [id=/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/virtualNetworks/aksnet]
azurerm_public_ip.vm: Refreshing state... [id=/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/publicIPAddresses/jump-box-pip]
azurerm_network_security_group.aks_nsg: Refreshing state... [id=/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/networkSecurityGroups/paks_nsg]
module.paks.azurerm_network_security_rule.aks["deny_tcp_10250_inbound"]: Refreshing state... [id=/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/networkSecurityGroups/paks_nsg/securityRules/deny_tcp_10250_inbound]
module.paks.azurerm_network_security_rule.aks["deny_tcp_10255_inbound"]: Refreshing state... [id=/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/networkSecurityGroups/paks_nsg/securityRules/deny_tcp_10255_inbound]
azurerm_subnet.akscontrolsub: Refreshing state... [id=/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/virtualNetworks/aksnet/subnets/akscontrolsub]
azurerm_subnet.aksnodesub: Refreshing state... [id=/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/virtualNetworks/aksnet/subnets/aksnodesub]
azurerm_network_interface.vm: Refreshing state... [id=/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/networkInterfaces/example-nic]
module.paks.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourcegroups/aks/providers/Microsoft.ContainerService/managedClusters/private-aks-westus-dev]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_network_security_group.aks_nsg has been changed
  ~ resource "azurerm_network_security_group" "aks_nsg" {
        id                  = "/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/networkSecurityGroups/paks_nsg"
        name                = "paks_nsg"
      ~ security_rule       = [
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "10250"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "deny_tcp_10250_inbound"
              + priority                                   = 500
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "10255"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "deny_tcp_10255_inbound"
              + priority                                   = 510
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {}
        # (2 unchanged attributes hidden)
    }
  # azurerm_public_ip.vm has been changed
  ~ resource "azurerm_public_ip" "vm" {
        id                      = "/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/publicIPAddresses/jump-box-pip"
      + ip_tags                 = {}
        name                    = "jump-box-pip"
        tags                    = {
            "cost_center"       = "06660"
            "environment"       = "dev"
            "owner"             = "t-go"
            "product"           = "private-aks"
            "region"            = "westus"
            "technical_contact" = "def-not-me"
        }
        # (10 unchanged attributes hidden)
    }
  # azurerm_virtual_network.aksvnet has been changed
  ~ resource "azurerm_virtual_network" "aksvnet" {
        id                    = "/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/virtualNetworks/aksnet"
        name                  = "aksnet"
      ~ subnet                = [
          + {
              + address_prefix = "172.16.0.0/24"
              + id             = "/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/virtualNetworks/aksnet/subnets/akscontrolsub"
              + name           = "akscontrolsub"
              + security_group = ""
            },
          + {
              + address_prefix = "172.16.1.0/24"
              + id             = "/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/virtualNetworks/aksnet/subnets/aksnodesub"
              + name           = "aksnodesub"
              + security_group = ""
            },
        ]
        tags                  = {
            "cost_center"       = "06660"
            "environment"       = "dev"
            "owner"             = "t-go"
            "product"           = "private-aks"
            "region"            = "westus"
            "technical_contact" = "def-not-me"
        }
        # (6 unchanged attributes hidden)
    }
  # azurerm_subnet.aksnodesub has been changed
  ~ resource "azurerm_subnet" "aksnodesub" {
        id                                             = "/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/virtualNetworks/aksnet/subnets/aksnodesub"
        name                                           = "aksnodesub"
      + service_endpoint_policy_ids                    = []
      + service_endpoints                              = []
        # (6 unchanged attributes hidden)
    }
  # azurerm_subnet.akscontrolsub has been changed
  ~ resource "azurerm_subnet" "akscontrolsub" {
        id                                             = "/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/virtualNetworks/aksnet/subnets/akscontrolsub"
        name                                           = "akscontrolsub"
      + service_endpoint_policy_ids                    = []
      + service_endpoints                              = []
        # (6 unchanged attributes hidden)
    }
  # module.paks.azurerm_kubernetes_cluster.aks has been changed
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourcegroups/aks/providers/Microsoft.ContainerService/managedClusters/private-aks-westus-dev"
        name                                = "private-aks-westus-dev"
        tags                                = {
            "cost_center"       = "06660"
            "environment"       = "dev"
            "owner"             = "t-go"
            "product"           = "private-aks"
            "region"            = "westus"
            "technical_contact" = "def-not-me"
        }
        # (17 unchanged attributes hidden)


      ~ default_node_pool {
          + availability_zones           = []
            name                         = "nodes"
          + node_taints                  = []
          + tags                         = {}
            # (19 unchanged attributes hidden)
        }





      ~ role_based_access_control {
            # (1 unchanged attribute hidden)

          ~ azure_active_directory {
              + admin_group_object_ids = []
                # (3 unchanged attributes hidden)
            }
        }
        # (5 unchanged blocks hidden)
    }
  # module.paks.azurerm_network_security_rule.aks["deny_tcp_10250_inbound"] has been changed
  ~ resource "azurerm_network_security_rule" "aks" {
      + destination_address_prefixes               = []
      + destination_application_security_group_ids = []
      + destination_port_ranges                    = []
        id                                         = "/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/networkSecurityGroups/paks_nsg/securityRules/deny_tcp_10250_inbound"
        name                                       = "deny_tcp_10250_inbound"
      + source_address_prefixes                    = []
      + source_application_security_group_ids      = []
      + source_port_ranges                         = []
        # (10 unchanged attributes hidden)
    }
  # module.paks.azurerm_network_security_rule.aks["deny_tcp_10255_inbound"] has been changed
  ~ resource "azurerm_network_security_rule" "aks" {
      + destination_address_prefixes               = []
      + destination_application_security_group_ids = []
      + destination_port_ranges                    = []
        id                                         = "/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/networkSecurityGroups/paks_nsg/securityRules/deny_tcp_10255_inbound"
        name                                       = "deny_tcp_10255_inbound"
      + source_address_prefixes                    = []
      + source_application_security_group_ids      = []
      + source_port_ranges                         = []
        # (10 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.vm will be created
  + resource "azurerm_linux_virtual_machine" "vm" {
      + admin_username                  = "adminuser"
      + allow_extension_operations      = true
      + computer_name                   = (known after apply)
      + disable_password_authentication = true
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "westus"
      + max_bid_price                   = -1
      + name                            = "jump-box"
      + network_interface_ids           = [
          + "/subscriptions/e5c064d7-9c8f-4e8d-ba57-5da9f1610cb3/resourceGroups/aks/providers/Microsoft.Network/networkInterfaces/example-nic",
        ]
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "aks"
      + size                            = "Standard_B1LS"
      + tags                            = {
          + "cost_center"       = "06660"
          + "environment"       = "dev"
          + "owner"             = "t-go"
          + "product"           = "private-aks"
          + "region"            = "westus"
          + "technical_contact" = "def-not-me"
        }
      + virtual_machine_id              = (known after apply)
      + zone                            = (known after apply)

      + admin_ssh_key {
          + public_key = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDC8i0X7VyK4ZiGNeyqKKWaGIjYKXz8EFVfSPOgS9yV0Jd8Tdtd00XyCPZVi5gpF8ofLiXHClEu990hAb3qwhH0IcjB+SrDSUnSp1mM4HKvepeXbHLRDTB0kBDhaI81/XqzRKDu/Gnh3db2KqTaO2zeFkXI30dCIOf41QT+3Mqz87LKJy6a5PVnX8BuRomZUPdVKJ+WnoGCMTlgCqxPDkKIzLQ8lREjTEOlby2hZKit7u/q+EVNXmOY7sAqwLgTo9Umk2GcfP5JQAOUOvpu9PlEFX+Z7wXN3Vs9N9Mt1IxE+sUswKOYGS4I1He3Z7SAQiWWqefQ+Cse+ogeDHF3YDbaXet6xnnjSG3kYBc5GD3U3Q5LEtAX31Exxp9vCgiPVtFVAYQzXHwYL3IOwtCGl0XsMfpj20Hrb/Yye7t4BRFxDAFk36H5nuldQ4g360LGE70ji7wmB/Jr+IXXEl2Spxat0uWJC9dh30Y4Q2ywfIUUVHQDcVleG0WO5l/4/aWJZc+u5QUwk42B4Kec/EOk7ewnE8Ce9/us/7uXRA/upaLAlaoj4Nipws7tPKMhFuA8TviGQgyx1GR+OtnaaEcbT3pVz7A4qg1fe2l0lL/W9ubb4Ao+AMNMm0Ao7liZw+zan/yW2+GHKvlQ6J0aOAXArJZ/SIxYawZj0YA9RzJsechRHw==
            EOT
          + username   = "thevitch"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "20_04-lts-gen2"
          + version   = "latest"
        }
    }

  # null_resource.cluster will be created
  + resource "null_resource" "cluster" {
      + id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @CultClassik, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Configuration Run`*